; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v7)
		(pred_6 ?v5)
		(pred_2 ?v3)
		(pred_5 ?v3)
		(pred_3 ?v5 ?v3)
		(pred_4)
		(pred_1 ?v5))

   (:action op_3
       :parameters  (?v4 ?v1)
       :precondition (and (not-eq ?v4 ?v1) 
                          (pred_2 ?v4) (pred_2 ?v1) (pred_5 ?v4))
       :effect (and  (pred_5 ?v1)
		     (not (pred_5 ?v4))))


   (:action op_1
       :parameters (?v2 ?v6)
       :precondition  (and  (pred_6 ?v2) (pred_2 ?v6)
			    (pred_3 ?v2 ?v6) (pred_5 ?v6) (pred_4))
       :effect (and (pred_1 ?v2)
		    (not (pred_3 ?v2 ?v6)) 
		    (not (pred_4))))

   (:action op_2
       :parameters  (?v2  ?v6)
       :precondition  (and  (pred_6 ?v2) (pred_2 ?v6)
			    (pred_1 ?v2) (pred_5 ?v6))
       :effect (and (pred_3 ?v2 ?v6)
		    (pred_4)
		    (not (pred_1 ?v2)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_02 obj_04 obj_05 obj_03 obj_01 obj_08 
          obj_07 obj_06 
)
(:init
(pred_2 obj_02)
(pred_2 obj_04)
(pred_2 obj_05)
(pred_2 obj_03)
(pred_2 obj_01)
(pred_2 obj_08)
(pred_6 obj_07)
(pred_6 obj_06)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(pred_4)
(pred_3 obj_07 obj_08)
(pred_3 obj_06 obj_08)
(pred_5 obj_08)
)
(:goal
(and
(pred_3 obj_07 obj_01)
(pred_3 obj_06 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_07 obj_01) (pred_5 obj_02))
    (sometime-before  (pred_3 obj_06 obj_01) (pred_5 obj_02))
  )
)
)

; plan
1. (op_1 obj_07 obj_08)
   deleted: (pred_3 obj_07 obj_08) (pred_4)
   added: (pred_1 obj_07)
   goals met: 0 of 2
2. (op_3 obj_08 obj_02)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_02)
   goals met: 0 of 2
3. (op_2 obj_07 obj_02)
   deleted: (pred_1 obj_07)
   added: (pred_3 obj_07 obj_02) (pred_4)
   goals met: 0 of 2
4. (op_3 obj_02 obj_08)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_08)
   goals met: 0 of 2
5. (op_1 obj_06 obj_08)
   deleted: (pred_3 obj_06 obj_08) (pred_4)
   added: (pred_1 obj_06)
   goals met: 0 of 2
6. (op_3 obj_08 obj_01)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_01)
   goals met: 0 of 2
7. (op_2 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_3 obj_06 obj_01) (pred_4)
   goals met: 1 of 2
8. (op_3 obj_01 obj_02)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_02)
   goals met: 1 of 2
9. (op_1 obj_07 obj_02)
   deleted: (pred_3 obj_07 obj_02) (pred_4)
   added: (pred_1 obj_07)
   goals met: 1 of 2
10. (op_3 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_01)
   goals met: 1 of 2
11. (op_2 obj_07 obj_01)
   deleted: (pred_1 obj_07)
   added: (pred_3 obj_07 obj_01) (pred_4)
   goals met: 2 of 2
